ExchangePlans/ОбменВРаспределеннойИнформационнойБазе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ExchangePlan>
		<Properties>
			<Name>ОбменВРаспределеннойИнформационнойБазе</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьДанныеПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьДанныеПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоРазделамДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазделыДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

InformationRegisters/НастройкиОрганизацийФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОрганизацийФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаполнениеПроизведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнениеПроизводится</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическихЛицКОбработке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическихЛицОбработано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиОрганизацийСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОрганизацийСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаполнениеПроизведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнениеПроизводится</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудниковКОбработке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудниковОбработано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПодразделенийФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодразделенийФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаполнениеПроизведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнениеПроизводится</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическихЛицКОбработке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическихЛицОбработано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПодразделенийСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодразделенийСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаполнениеПроизведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаполнениеПроизводится</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудниковКОбработке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудниковОбработано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ExchangePlans/ОбменВРаспределеннойИнформационнойБазе/Forms/ФормаУзла/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.Служебные.Видимость	= Ложь;
		Элементы.Служебные.Доступность	= Ложь;
	КонецЕсли;
	
	РежимСинхронизацииОрганизаций =
		?(Объект.ИспользоватьОтборПоОрганизациям И Объект.СинхронизироватьДанныеПоОрганизациям,
			"СинхронизироватьДанныеТолькоПоВыбраннымОрганизациям", "СинхронизироватьДанныеПоВсемОрганизациям");
	
	Организации.Загрузить(СинхронизацияДанныхЗарплатаКадрыСервер.ВсеОрганизацииПриложения());
	
	ОтметитьВыбранныеЭлементыТаблицы("Организации", "Организация");
	
	РежимСинхронизацииПодразделений =
		?(Объект.ИспользоватьОтборПоПодразделениям И Объект.СинхронизироватьДанныеПоПодразделениям,
			"СинхронизироватьДанныеТолькоПоВыбраннымПодразделениям", "СинхронизироватьДанныеПоВсемПодразделениям");
	РежимСинхронизацииРазделов =
		?(Объект.ИспользоватьОтборПоРазделамДанных И Объект.СинхронизироватьДанныеПоПодразделениям,
			"СинхронизироватьДанныеТолькоПоВыбраннымРазделам", "СинхронизироватьДанныеПоВсемРазделам");
	
	ДоступностьПодразделений = СинхронизацияДанныхЗарплатаКадрыСервер.ИспользуетсяСтруктураПредприятия();
	
	ЗаполнитьДеревоПодразделений();
	
	ЗаполнитьДеревоРазделовДанных();
	
	// По умолчанию считаем, что после записи форму нужно закрыть, 
	// в связи с тем, что нельзя обработать событие закрытия в веб-клиенте.
	ЗакрыватьПослеЗаписи = Истина;
	
	УстановитьВидимостьЭлементов();
	Если Не Элементы.ГруппаНастройкиВыгрузкиДанныхПоПодразделениям.Видимость Тогда
		Если Не Объект.СинхронизироватьДанныеПоОрганизациям Тогда
			Объект.СинхронизироватьДанныеПоОрганизациям = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьВыполнениеОтложеннойОбработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РежимСинхронизацииОрганизацийПриИзмененииЗначения();
	РежимСинхронизацииПодразделенийПриИзмененииЗначения();
	РежимСинхронизацииРазделовПриИзмененииЗначения();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ПроизводитсяЗаполнениеДанных Тогда
		ПодключитьОбработчикОжидания("ОтложеннаяОбработкаПрогресс", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ВыполняетсяНачальнаяНастройкаПрограммы() Тогда
		
		Отказ = Истина;
		
		ТекстПредупреждения = 
			НСтр("ru = 'Запись настройки узла невозможна, пока не завершена начальная настройка программы.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзФормы", Истина);
	
	ТекущийОбъект.ИспользоватьОтборПоОрганизациям =
		(РежимСинхронизацииОрганизаций = "СинхронизироватьДанныеТолькоПоВыбраннымОрганизациям");
	
	Если ТекущийОбъект.ИспользоватьОтборПоОрганизациям Тогда
		ТекущийОбъект.Организации.Загрузить(Организации.Выгрузить(Новый Структура("Использовать", Истина), "Организация"));
	Иначе
		ТекущийОбъект.Организации.Очистить();
	КонецЕсли;
	
	ТекущийОбъект.ИспользоватьОтборПоПодразделениям =
		(РежимСинхронизацииПодразделений = "СинхронизироватьДанныеТолькоПоВыбраннымПодразделениям");
	
	ТекущийОбъект.Подразделения.Очистить();
	Если ТекущийОбъект.ИспользоватьОтборПоПодразделениям Тогда
		ПодразделенияДерево = РеквизитФормыВЗначение("Подразделения");
		НайденныеСтроки = ПодразделенияДерево.Строки.НайтиСтроки(Новый Структура("Использовать", Истина), Истина);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НоваяСтрока = ТекущийОбъект.Подразделения.Добавить();
			НоваяСтрока.Подразделение = НайденнаяСтрока.Подразделение;
		КонецЦикла;
		Если ТекущийОбъект.Подразделения.Количество() = 1
			И Не ЗначениеЗаполнено(ТекущийОбъект.Подразделения[0].Подразделение) Тогда
			
			Отказ = Истина;
			
			ТекстПредупреждения = НСтр("ru = 'Запись настройки узла невозможна.
			|Нельзя устанавливать отбор только по незаполненному подразделению.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстПредупреждения, ТекущийОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		ТекущийОбъект.ИспользоватьОтборПоРазделамДанных =
			(РежимСинхронизацииРазделов = "СинхронизироватьДанныеТолькоПоВыбраннымРазделам");
		ТекущийОбъект.ЗаполнитьТабличнуюЧастьРазделыДанных(ВыбранныеРазделыДанных());
	Иначе
		ТекущийОбъект.ИспользоватьОтборПоРазделамДанных = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗавершитьНастройкуСинхронизацииДанных(ТекущийОбъект, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СинхронизацияДанныхЗарплатаКадры.ЗапуститьОтложеннуюОбработкуЗаполненияДанныхПоФизическимЛицам(ТекущийОбъект);
	СинхронизацияДанныхЗарплатаКадры.ЗапуститьОтложеннуюОбработкуЗаполненияДанныхПоСотрудникам(ТекущийОбъект);
	ПроверитьВыполнениеОтложеннойОбработки();
	
	Если Не ЗакрыватьПослеЗаписи Тогда
		// Признак необходимости закрытия держим постоянно взведенным.
		ЗакрыватьПослеЗаписи = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("ЗакрытаФормаУзлаПланаОбмена");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимСинхронизацииОрганизацийПриИзменении(Элемент)
	
	РежимСинхронизацииОрганизацийПриИзмененииЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииПодразделенийПриИзменении(Элемент)
	РежимСинхронизацииПодразделенийПриИзмененииЗначения();
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииРазделовПриИзменении(Элемент)
	РежимСинхронизацииРазделовПриИзмененииЗначения();
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьДанныеПоОрганизациямПриИзменении(Элемент)
	
	РежимСинхронизацииОрганизацийПриИзмененииЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьДанныеПоПодразделениямПриИзменении(Элемент)
	
	Если ДоступностьПодразделений Или РежимСинхронизацииОрганизаций = "СинхронизироватьДанныеПоВсемОрганизациям" Тогда
		РежимСинхронизацииПодразделений = "СинхронизироватьДанныеПоВсемПодразделениям";
	Иначе
		РежимСинхронизацииПодразделений = "СинхронизироватьДанныеТолькоПоВыбраннымПодразделениям";
	КонецЕсли;
	РежимСинхронизацииРазделов = "СинхронизироватьДанныеПоВсемРазделам";	
	
	РежимСинхронизацииПодразделенийПриИзмененииЗначения();
	РежимСинхронизацииРазделовПриИзмененииЗначения();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьДанныеПоОрганизациямРасширеннаяПодсказкаНажатие(Элемент)
	
	ВыбранныеРазделы = Новый Массив;
	ВыбранныеРазделы.Добавить("РегламентированныеДанные");
	ВыбранныеРазделы.Добавить("ОбщиеДанные");

	Уникальность = "Отчет.МигрирующиеОбъектыРИБ/КлючВарианта.ОбъектыРегламентированногоУчета";
	
	СформироватьОтчетМигрирующиеОбъектыРИБ("ОбъектыРегламентированногоУчета", Уникальность, ВыбранныеРазделы);
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьДанныеПоПодразделениямРасширеннаяПодсказкаНажатие(Элемент)
	
	ВыбранныеРазделы = Новый Массив;
	ВыбранныеРазделы.Добавить("ОбщиеДанные");
	ВыбранныеРазделы.Добавить("УправленческиеДанные");
	УправленческиеРазделыДанных = УправленческиеРазделыДанных();
	Для Каждого РазделДанных Из УправленческиеРазделыДанных Цикл
		ВыбранныеРазделы.Добавить(РазделДанных);
	КонецЦикла;

	Уникальность = "Отчет.МигрирующиеОбъектыРИБ/КлючВарианта.ОбъектыУправленческогоУчета";
	
	СформироватьОтчетМигрирующиеОбъектыРИБ("ОбъектыУправленческогоУчета", Уникальность, ВыбранныеРазделы);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииРазделовРасширеннаяПодсказкаНажатие(Элемент)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед формированием отчета необходимо сохранить изменения'"));
		Возврат;
	КонецЕсли;
	
	РазделыДанныхОбъекта = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.РазделыДанных Цикл
		РазделыДанныхОбъекта.Добавить(ТекущаяСтрока.Идентификатор);
	КонецЦикла;
	
	Уникальность = "Отчет.МигрирующиеОбъектыРИБ/КлючВарианта.РазделыДанныхОбъектов";
	
	СформироватьОтчетМигрирующиеОбъектыРИБ("РазделыДанныхОбъектов", Уникальность,
		РазделыДанныхОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодразделения

&НаКлиенте
Процедура ПодразделенияИспользоватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Подразделения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодразделенияИспользоватьПриИзмененииНаСервере(ТекущиеДанные.Подразделение, ТекущиеДанные.Использовать);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыДанныхИспользоватьПриИзменении(Элемент)

	ТекущиеДанные = Элементы.РазделыДанных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РазделыДанныхИспользоватьПриИзмененииНаСервере(ТекущиеДанные.Идентификатор, ТекущиеДанные.Использовать);
	
	Если ТекущиеДанные.Использовать Тогда
		УстановитьИспользованиеУРодителей(ТекущиеДанные, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВсеОрганизации(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Истина, "Организации");
	Если Не ДоступностьПодразделений Тогда
		ВключитьОтключитьВсеЭлементыВДеревеЗначений(Истина, Подразделения.ПолучитьЭлементы());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеОрганизации(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Ложь, "Организации");
	Если Не ДоступностьПодразделений Тогда
		ВключитьОтключитьВсеЭлементыВДеревеЗначений(Ложь, Подразделения.ПолучитьЭлементы());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеПодразделения(Команда)
	ВключитьОтключитьВсеЭлементыВДеревеЗначений(Истина, Подразделения.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеПодразделения(Команда)
	ВключитьОтключитьВсеЭлементыВДеревеЗначений(Ложь, Подразделения.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеРазделыДанных(Команда)
	ВключитьОтключитьВсеЭлементыВДеревеЗначений(Истина, РазделыДанных.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеРазделыДанных(Команда)
	ВключитьОтключитьВсеЭлементыВДеревеЗначений(Ложь, РазделыДанных.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеФормы(Команда)
	
	ЗакрыватьПослеЗаписи = Ложь;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	Если ЭтоЗаписьПервогоУзлаСОтбором() Тогда
		
		ТекстВопроса =
			НСтр("ru='При записи настройки будет произведено заполнение организаций и структурных подразделений по сотрудникам и физическим лицам.
			|Создание начального образа будет недоступно, пока заполнение данных не будет выполнено.
			|Продолжить?'");
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьКомандуЗаписать", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе
		
		Записать();
		Если ЗакрыватьПослеЗаписи И Не ВыполняетсяНачальнаяНастройкаПрограммы() Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНачальногоОбраза(Команда)
	
	Если Не СинхронизацияРазрешена() Тогда
		
		ТекстПредупреждения =
			НСтр("ru='Производится заполнение организаций и структурных подразделений по сотрудникам и физическим лицам.
			|Создание начального образа недоступно, пока заполнение данных не будет выполнено.'");
		
		ПоказатьПредупреждение(, ТекстПредупреждения, , НСтр("ru = 'Создание начального образа не доступно'"));
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыПомощника = Новый Структура("Ключ, Узел", Объект.Ссылка, Объект.Ссылка);
	
	ОткрытьФорму("ОбщаяФорма.СозданиеНачальногоОбразаСФайлами",
		ПараметрыПомощника, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервере
Функция ВыполняетсяНачальнаяНастройкаПрограммы()
	Возврат НачальнаяНастройкаПрограммы.ВыполняетсяНачальнаяНастройкаПрограммы();
КонецФункции

&НаСервере
Процедура ЗавершитьНастройкуСинхронизацииДанных(ТекущийОбъект, Отказ = Ложь)
	
	Если СинхронизацияДанныхЗарплатаКадрыСервер.СинхронизацияРазрешена(ТекущийОбъект) Тогда
		ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьКомандуЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрыватьПослеЗаписи = Ложь;
	ПроизводитсяЗаполнениеДанных = Истина;
	
	ПодключитьОбработчикОжидания("ОтложеннаяОбработкаПрогресс", 0.2, Истина);
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтключитьВсеЭлементыВТаблице(Включить, ИмяТаблицы)
	
	Для Каждого ЭлементКоллекции Из ЭтаФорма[ИмяТаблицы] Цикл
		ЭлементКоллекции.Использовать = Включить;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтключитьВсеЭлементыВДеревеЗначений(Включить, Строки)
	
	Для Каждого ЭлементКоллекции Из Строки Цикл
		ЭлементКоллекции.Использовать = Включить;
		ВключитьОтключитьВсеЭлементыВДеревеЗначений(Включить, ЭлементКоллекции.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьВыбранныеЭлементыТаблицы(ИмяТаблицы, ИмяРеквизита)
	
	Для Каждого СтрокаТаблицы Из Объект[ИмяТаблицы] Цикл
		Строки = ЭтаФорма[ИмяТаблицы].НайтиСтроки(Новый Структура(ИмяРеквизита, СтрокаТаблицы[ИмяРеквизита]));
		
		Для Каждого НайденнаяСтрока Из Строки Цикл
			НайденнаяСтрока.Использовать = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииОрганизацийПриИзмененииЗначения()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Организации", "Доступность", 
		РежимСинхронизацииОрганизаций = "СинхронизироватьДанныеТолькоПоВыбраннымОрганизациям"
			И Объект.СинхронизироватьДанныеПоОрганизациям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РежимСинхронизацииОрганизаций",
		"Доступность", Объект.СинхронизироватьДанныеПоОрганизациям);
	
	Если Не Объект.СинхронизироватьДанныеПоОрганизациям Тогда
		РежимСинхронизацииОрганизаций = "СинхронизироватьДанныеПоВсемОрганизациям";
		Для Каждого Организация Из Организации Цикл
			Если Организация.Использовать Тогда
				Организация.Использовать = Ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли РежимСинхронизацииОрганизаций = "СинхронизироватьДанныеПоВсемОрганизациям" Тогда
		Для Каждого Организация Из Организации Цикл
			Если Не Организация.Использовать Тогда
				Организация.Использовать = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииПодразделенийПриИзмененииЗначения()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подразделения", "Доступность", 
		РежимСинхронизацииПодразделений = "СинхронизироватьДанныеТолькоПоВыбраннымПодразделениям"
			И Объект.СинхронизироватьДанныеПоПодразделениям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РежимСинхронизацииПодразделений",
		"Доступность", Объект.СинхронизироватьДанныеПоПодразделениям);
	
	Если Не Объект.СинхронизироватьДанныеПоПодразделениям Тогда
		РежимСинхронизацииПодразделений = "СинхронизироватьДанныеПоВсемПодразделениям";
		УстановитьИспользованиеОбъектов(Подразделения.ПолучитьЭлементы(), Ложь);
	ИначеЕсли РежимСинхронизацииПодразделений = "СинхронизироватьДанныеПоВсемПодразделениям" Тогда
		УстановитьИспользованиеОбъектов(Подразделения.ПолучитьЭлементы(), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииРазделовПриИзмененииЗначения()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РазделыДанных", "Доступность", 
		РежимСинхронизацииРазделов = "СинхронизироватьДанныеТолькоПоВыбраннымРазделам"
			И Объект.СинхронизироватьДанныеПоПодразделениям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РежимСинхронизацииРазделов",
		"Доступность", Объект.СинхронизироватьДанныеПоПодразделениям);
	
	Если Не Объект.СинхронизироватьДанныеПоПодразделениям Тогда
		РежимСинхронизацииРазделов = "СинхронизироватьДанныеПоВсемРазделам";
		УстановитьИспользованиеОбъектов(РазделыДанных.ПолучитьЭлементы(), Ложь);
	ИначеЕсли РежимСинхронизацииРазделов = "СинхронизироватьДанныеПоВсемРазделам" Тогда
		УстановитьИспользованиеОбъектов(РазделыДанных.ПолучитьЭлементы(), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодразделенияИспользоватьПриИзмененииНаСервере(Подразделение, Использование)
	
	МассивПодразделений = Новый Массив;
	Если Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка() Тогда
		МассивПодразделений.Добавить(Подразделение);
	ИначеЕсли ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		МассивПодразделений = Модуль.ПодчиненныеПодразделения(Подразделение);
	КонецЕсли;
	
	УстановитьИспользованиеОбъекта(Подразделения.ПолучитьЭлементы(), МассивПодразделений, "Подразделение", Использование);
	
КонецПроцедуры

&НаСервере
Процедура РазделыДанныхИспользоватьПриИзмененииНаСервере(Идентификатор, Использование)
	
	РазделыДанныхТаблица = СинхронизацияДанныхЗарплатаКадрыСервер.РазделыДанных(Идентификатор);
	МассивРазделов = ОбщегоНазначения.ВыгрузитьКолонку(РазделыДанныхТаблица, "Идентификатор");
	
	УстановитьИспользованиеОбъекта(РазделыДанных.ПолучитьЭлементы(), МассивРазделов, "Идентификатор", Использование);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИспользованиеУРодителей(ТекущиеДанные, Значение)
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Если Родитель <> Неопределено Тогда
		Родитель.Использовать = Значение;
		УстановитьИспользованиеУРодителей(Родитель, Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИспользованиеОбъектов(Коллекция, Использовать)
	
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		Если ЭлементКоллекции.Использовать <> Использовать Тогда
			ЭлементКоллекции.Использовать = Использовать;
		КонецЕсли;
		УстановитьИспользованиеОбъектов(ЭлементКоллекции.ПолучитьЭлементы(), Использовать);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИспользованиеОбъекта(ЭлементыДерева, МассивОбъектов, ИмяКолонки, Использование)
	
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл
		Если МассивОбъектов.Найти(СтрокаДерева[ИмяКолонки]) <> Неопределено Тогда
			СтрокаДерева.Использовать = Использование;
		КонецЕсли;
		УстановитьИспользованиеОбъекта(СтрокаДерева.ПолучитьЭлементы(), МассивОбъектов, ИмяКолонки, Использование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	ВидимостьГруппыНастройкиПоПодразделениям =
		ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНастройкиВыгрузкиДанныхПоПодразделениям", "Видимость", ВидимостьГруппыНастройкиПоПодразделениям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНастройкиВыгрузкиДанныхПоРазделам", "Видимость", ВидимостьГруппыНастройкиПоПодразделениям
		И Объект.СинхронизироватьДанныеПоПодразделениям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СинхронизироватьДанныеПоОрганизациям", "Видимость", ВидимостьГруппыНастройкиПоПодразделениям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаЗаполнениеДанных", "Видимость", ПроизводитсяЗаполнениеДанных);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПроцентВыполненияПоОрганизациям", "Видимость", ПроизводитсяЗаполнениеДанных);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПроцентВыполненияПоПодразделениям", "Видимость", ПроизводитсяЗаполнениеДанных);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОбщаяКомандаВыполнитьОбменДанными", "Доступность", Не ПроизводитсяЗаполнениеДанных);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СозданиеНачальногоОбраза", "Доступность", Не ПроизводитсяЗаполнениеДанных);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВыполнениеОтложеннойОбработки()
	
	ПроизводитсяЗаполнениеДанных = 
		СинхронизацияДанныхЗарплатаКадрыСервер.ОрганизацииФизическихЛицЗаполняются()
		Или СинхронизацияДанныхЗарплатаКадрыСервер.ПодразделенияФизическихЛицЗаполняются()
		Или ПроизводитсяЗаполнениеДанных
		Или СинхронизацияДанныхЗарплатаКадрыСервер.ОрганизацииСотрудниковЗаполняются()
		Или СинхронизацияДанныхЗарплатаКадрыСервер.ПодразделенияСотрудниковЗаполняются();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложеннаяОбработкаПрогресс()
	
	Если ПроизводитсяЗаполнениеДанных Или Не СинхронизацияРазрешена() Тогда
		ОтложеннаяОбработкаПрогрессНаСервере();
		ИнтервалВызоваМетода = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 4, 0.8);
		ПодключитьОбработчикОжидания("ОтложеннаяОбработкаПрогресс", ИнтервалВызоваМетода, Истина);
	Иначе
		ОтключитьОбработчикОжидания("ОтложеннаяОбработкаПрогресс");
		ЗавершитьНастройкуСинхронизацииДанных(Объект.Ссылка);
		Если ЗакрыватьПослеЗаписи Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СинхронизацияРазрешена()
	Возврат СинхронизацияДанныхЗарплатаКадрыСервер.СинхронизацияРазрешена(Объект.Ссылка);
КонецФункции

&НаСервере
Процедура ОтложеннаяОбработкаПрогрессНаСервере()
	
	ПроизводитсяЗаполнениеДанных = Ложь;
	ПроцентВыполненияПоОрганизациям = 0;
	ПроцентВыполненияПоПодразделениям = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НастройкиОрганизаций.ЗаполнениеПроизводится), ЛОЖЬ) КАК ЗаполнениеПроизводится,
	|	ЕСТЬNULL(СУММА(НастройкиОрганизаций.ОбъектовКОбработке), 0) КАК ОбъектовКОбработке,
	|	ЕСТЬNULL(СУММА(НастройкиОрганизаций.ОбъектовОбработано), 0) КАК ОбъектовОбработано
	|ИЗ
	|	(ВЫБРАТЬ
	|		НастройкиОрганизацийФизическихЛиц.ЗаполнениеПроизводится КАК ЗаполнениеПроизводится,
	|		НастройкиОрганизацийФизическихЛиц.ФизическихЛицКОбработке КАК ОбъектовКОбработке,
	|		НастройкиОрганизацийФизическихЛиц.ФизическихЛицОбработано КАК ОбъектовОбработано
	|	ИЗ
	|		РегистрСведений.НастройкиОрганизацийФизическихЛиц КАК НастройкиОрганизацийФизическихЛиц
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НастройкиОрганизацийСотрудников.ЗаполнениеПроизводится,
	|		НастройкиОрганизацийСотрудников.СотрудниковКОбработке,
	|		НастройкиОрганизацийСотрудников.СотрудниковОбработано
	|	ИЗ
	|		РегистрСведений.НастройкиОрганизацийСотрудников КАК НастройкиОрганизацийСотрудников) КАК НастройкиОрганизаций";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПроизводитсяЗаполнениеДанных = ПроизводитсяЗаполнениеДанных Или Выборка.ЗаполнениеПроизводится;
		Если Выборка.ОбъектовКОбработке <> 0 Тогда
			ПроцентВыполненияПоОрганизациям = 100 * Выборка.ОбъектовОбработано / Выборка.ОбъектовКОбработке;
		Иначе
			ПроцентВыполненияПоОрганизациям = 0;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НастройкиПодразделений.ЗаполнениеПроизводится), ЛОЖЬ) КАК ЗаполнениеПроизводится,
	|	ЕСТЬNULL(СУММА(НастройкиПодразделений.ОбъектовКОбработке), 0) КАК ОбъектовКОбработке,
	|	ЕСТЬNULL(СУММА(НастройкиПодразделений.ОбъектовОбработано), 0) КАК ОбъектовОбработано
	|ИЗ
	|	(ВЫБРАТЬ
	|		НастройкиПодразделенийФизическихЛиц.ЗаполнениеПроизводится КАК ЗаполнениеПроизводится,
	|		НастройкиПодразделенийФизическихЛиц.ФизическихЛицКОбработке КАК ОбъектовКОбработке,
	|		НастройкиПодразделенийФизическихЛиц.ФизическихЛицОбработано КАК ОбъектовОбработано
	|	ИЗ
	|		РегистрСведений.НастройкиПодразделенийФизическихЛиц КАК НастройкиПодразделенийФизическихЛиц
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НастройкиПодразделенийСотрудников.ЗаполнениеПроизводится,
	|		НастройкиПодразделенийСотрудников.СотрудниковКОбработке,
	|		НастройкиПодразделенийСотрудников.СотрудниковОбработано
	|	ИЗ
	|		РегистрСведений.НастройкиПодразделенийСотрудников КАК НастройкиПодразделенийСотрудников) КАК НастройкиПодразделений";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПроизводитсяЗаполнениеДанных = ПроизводитсяЗаполнениеДанных Или Выборка.ЗаполнениеПроизводится;
		Если Выборка.ОбъектовКОбработке <> 0 Тогда
			ПроцентВыполненияПоПодразделениям = 100 * Выборка.ОбъектовОбработано / Выборка.ОбъектовКОбработке;
		Иначе
			ПроцентВыполненияПоПодразделениям = 0;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
	ПредыдущийПроцентВыполненияПоОрганизациям = ПроцентВыполненияПоОрганизациям;
	ПредыдущийПроцентВыполненияПоПодразделениям = ПроцентВыполненияПоПодразделениям;
	
КонецПроцедуры

&НаСервере
Функция ЭтоЗаписьПервогоУзлаСОтбором()
	
	Если (Не СинхронизацияДанныхЗарплатаКадрыСервер.ИспользуютсяУзлыРИБСОтборомПоОрганизациям(Объект.Ссылка) 
			И РежимСинхронизацииОрганизаций = "СинхронизироватьДанныеТолькоПоВыбраннымОрганизациям"
			И Объект.СинхронизироватьДанныеПоОрганизациям)
		Или (Не СинхронизацияДанныхЗарплатаКадрыСервер.ИспользуютсяУзлыРИБСОтборомПоПодразделениям(Объект.Ссылка)
			И РежимСинхронизацииПодразделений = "СинхронизироватьДанныеТолькоПоВыбраннымПодразделениям"
			И Объект.СинхронизироватьДанныеПоПодразделениям) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции

&НаСервере
Функция ВыбранныеРазделыДанных()

	ВыбранныеРазделы = Новый Массив;
	
	РазделыДерево = РеквизитФормыВЗначение("РазделыДанных");
	НайденныеСтроки = РазделыДерево.Строки.НайтиСтроки(Новый Структура("Использовать", Истина), Истина);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ВыбранныеРазделы.Добавить(НайденнаяСтрока.Идентификатор);
	КонецЦикла;
	
	Возврат ВыбранныеРазделы;
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчетМигрирующиеОбъектыРИБ(КлючВарианта, Уникальность, ВыбранныеРазделы)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", КлючВарианта);
	ПараметрыОткрытия.Вставить("КлючПараметровПечати", Уникальность);
	ПараметрыОткрытия.Вставить("КлючСохраненияПоложенияОкна", Уникальность);
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("ТолькоОбъектыИнтерфейсныхПодсистем", Истина);
	ПараметрыОткрытия.Вставить("ИмяПланаОбмена", "ОбменВРаспределеннойИнформационнойБазе");

	Отбор = Новый Структура;
	Отбор.Вставить("РазделДанныхОбъектаИдентификатор", ВыбранныеРазделы);
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Отчет.МигрирующиеОбъектыРИБ.Форма", ПараметрыОткрытия, ЭтаФорма, Уникальность);
	
КонецПроцедуры

&НаСервере
Функция УправленческиеРазделыДанных()
	Возврат СинхронизацияДанныхЗарплатаКадрыСервер.РазделыДанных("УправленческиеДанные").ВыгрузитьКолонку("Идентификатор");
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПодразделений()
	
	ВсеПодразделенияПриложения = СинхронизацияДанныхЗарплатаКадрыСервер.ВсеПодразделенияПриложения();
	
	Если ВсеПодразделенияПриложения <> Неопределено Тогда
		НаименованияПодразделений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			ВсеПодразделенияПриложения.ВыгрузитьКолонку("Подразделение"), "Наименование");
		ВсеПодразделенияПриложения.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
		
		Для Каждого ТекущаяСтрока Из ВсеПодразделенияПриложения Цикл
			ТекущаяСтрока.Представление = НаименованияПодразделений[ТекущаяСтрока.Подразделение];
		КонецЦикла;
		НоваяСтрока = ВсеПодразделенияПриложения.Добавить();
		НоваяСтрока.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
		НоваяСтрока.Представление = "Незаполненное подразделение";
		
		ПодразделенияДерево = РеквизитФормыВЗначение("Подразделения");
		
		ЗаполнитьДерево(ПодразделенияДерево, ВсеПодразделенияПриложения, Объект.Подразделения, "Подразделение",
			"ПодразделениеРодитель");
		СтрокаДерева = ПодразделенияДерево.Строки.Найти(Справочники.СтруктураПредприятия.ПустаяСсылка(),
			"Подразделение", Ложь);
		ПодразделенияДерево.Строки.Сдвинуть(ПодразделенияДерево.Строки.Индекс(СтрокаДерева),
			ПодразделенияДерево.Строки.Количество() - 1);
		
		ЗначениеВРеквизитФормы(ПодразделенияДерево, "Подразделения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоРазделовДанных()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		РазделыДанныхТаблица = СинхронизацияДанныхЗарплатаКадрыСервер.РазделыДанных(
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().УправленческиеДанные);
		РазделыДерево = РеквизитФормыВЗначение("РазделыДанных");
		ЗаполнитьДерево(РазделыДерево, РазделыДанныхТаблица, Объект.РазделыДанных, "Идентификатор", "Родитель");
		ЗначениеВРеквизитФормы(РазделыДерево, "РазделыДанных");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево(Дерево, ТаблицаДанных, ТабличнаяЧасть, ИмяРеквизита, ИмяРеквизитаРодитель)
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		СтрокаРодителя = Дерево.Строки.Найти(СтрокаТаблицы[ИмяРеквизитаРодитель], ИмяРеквизита, Истина);
		Если СтрокаРодителя = Неопределено Тогда
			СтрокаДерева = Дерево.Строки.Добавить();
		Иначе
			СтрокаДерева = СтрокаРодителя.Строки.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);
		Если ТаблицаДанных.Колонки.Найти("Картинка") <> Неопределено Тогда
			СтрокаДерева.Картинка = СтрокаТаблицы.Картинка;
		КонецЕсли;
	КонецЦикла;
	Дерево.Строки.Сортировать(ИмяРеквизита, Истина);
	
	// Отметим выбранные элементы
	Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
		НайденнаяСтрока = Дерево.Строки.Найти(СтрокаТаблицы[ИмяРеквизита], ИмяРеквизита, Истина);
		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.Использовать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
